export const getWeatherDescription = (code) => {
    const codes = {
      0: "آسمان صاف",
      1: "کمی ابری",
      2: "نیمه ابری",
      3: "تمام ابری",
      45: "مه‌آلود",
      48: "مه یخ‌زده",
      51: "باران ریز",
      53: "باران ملایم",
      55: "باران شدید",
      61: "باران پراکنده",
      63: "باران",
      65: "رگبار شدید",
      71: "برف سبک",
      73: "برف",
      75: "برف سنگین",
      80: "رگبار باران",
      81: "رگبار شدید",
      82: "سیل‌آسا",
      95: "رعد و برق",
      96: "تگرگ",
    };
    return codes[code] || "ناشناخته";
  };